#+TITLE: TAU urban audio visual scenes 2021

*** Structure of this repository

    #+BEGIN_SRC sh :results output :exports results :eval no
    /usr/local/bin/tree ./
    #+END_SRC

     #+RESULTS:
     #+begin_example
.
|-- create_data
|   |-- create_tr.py
|   |-- create_tr.sh
|   |-- create_tt.py
|   |-- create_tt.sh
|   |-- create_val.py
|   |-- create_val.sh
|   |-- evaluation_setup
|   |   |-- train.csv
|   |   `-- val.csv
|   |-- features_data
|   |   |-- audio_features_data
|   |   |   |-- global_mean_std.npz
|   |   |   |-- tr.hdf5
|   |   |   |-- tt.hdf5
|   |   |   `-- val.hdf5
|   |   `-- video_features_data
|   |       |-- global_mean_std.npz
|   |       |-- tr.hdf5
|   |       |-- tt.hdf5
|   |       `-- val.hdf5
|   `-- split_data.py
|-- readme.org
|-- requirements_openl3.txt
|-- requirements_torch.txt
|-- train
|   |-- audio_model
|   |   `-- model.pt
|   |-- audio_output.csv
|   |-- audio_video_model
|   |   `-- model.pt
|   |-- audio_video_output.csv
|   |-- gpu_train.sh
|   |-- model.py
|   |-- TAU_Urban_Dataset.py
|   |-- test_DCASE.py
|   |-- test.py
|   |-- train.py
|   |-- video_model
|   |   `-- model.pt
|   `-- video_output.csv
`-- train_combine
    |-- audio_video_model
    |   `-- model.pt
    |-- audio_video_output_proposed.csv
    |-- gpu_train.sh
    |-- model_combine.py
    |-- model.py
    |-- TAU_Urban_Dataset.py
    |-- test_DCASE.py
    |-- test.py
    `-- train.py
     #+end_example

1. *split_data.py:* split the fold1_train.csv files into training set and validation set which are saved in the =./create_data/evaluation_setup/= folder.

2. *create_tr.py  create_val.py create_tt.py:* create embedding features for training, validation, and testing set using the pretrained openl3 network. These features are saved in =./create_data/features_data/= folder.

3. *readme.org:* this file which explains how the system is built.

4. *requirements_openl3.txt:* conda environment for creating features using the pretrained openl3 network.

5. *requirements_torch.txt:* conda environment for developing this system.

6. under the folder =./train/=: *model.py*: define the audio sub-network, video sub-network, and early A-V fusion network. *TAU_Urban_Dataset.py*: define the dataset. *train.py*: train these three networks based on the model_type. Trained weights are saved in =./train/audio_model/model.pt=, =./train/video_model/model.pt=, =./train/audio_video_model/model.pt=. *test.py*: test these three networks based on the model_type, of which results are presented in the ICASSP paper. *test_DCASE.py*: test these three networks based on one second, which is the DCASE challenge test setup. Output files are saved as csv files in the same folder. *gpu_train.sh*: sbatch scripts for submitting the job to the server.

7. under the folder =./train_combine/=: *model.py*: same as above. *model_combine.py*: the proposed model. *TAU_Urban_Dataset.py*: same as above, *train.py*: train the proposed network. Trained weights are saved in =./train_combine/audio_video_model/model.pt=. *test.py*: same as above, *test_DCASE.py*: same as above. *gpu_train.sh*: same as above. Output files are saved as csv files under the same folder.



